; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 2715)
	(= (fuel plane1) 156)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city1)
	(= (capacity plane2) 11743)
	(= (fuel plane2) 1811)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 9)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 10)
	(at plane3 city2)
	(= (capacity plane3) 11885)
	(= (fuel plane3) 390)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 8)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 10)
	(at plane4 city4)
	(= (capacity plane4) 6702)
	(= (fuel plane4) 199)
	(= (slow-burn plane4) 3)
	(= (fast-burn plane4) 11)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at person1 city0)
	(at person2 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 762)
	(= (distance city0 city2) 610)
	(= (distance city0 city3) 613)
	(= (distance city0 city4) 942)
	(= (distance city1 city0) 762)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 603)
	(= (distance city1 city3) 974)
	(= (distance city1 city4) 633)
	(= (distance city2 city0) 610)
	(= (distance city2 city1) 603)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 748)
	(= (distance city2 city4) 994)
	(= (distance city3 city0) 613)
	(= (distance city3 city1) 974)
	(= (distance city3 city2) 748)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 504)
	(= (distance city4 city0) 942)
	(= (distance city4 city1) 633)
	(= (distance city4 city2) 994)
	(= (distance city4 city3) 504)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city3)
	(at person1 city2)
	(at person2 city4)
	))

(:metric minimize (+ (* 5 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane2 city1)
   changed: (fuel plane2) from 1811 to 11743
   goals met: 1 of 3
2. (zoom plane2 city1 city0)
   deleted: (at plane2 city1)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 0 to 6858, (fuel plane2) from 11743 to 4885
   goals met: 1 of 3
3. (board person1 plane2 city0)
   deleted: (at person1 city0)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 3
4. (fly plane2 city0 city3)
   deleted: (at plane2 city0)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 6858 to 9310, (fuel plane2) from 4885 to 2433
   goals met: 2 of 3
5. (refuel plane2 city3)
   changed: (fuel plane2) from 2433 to 11743
   goals met: 2 of 3
6. (fly plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 9310 to 12302, (fuel plane2) from 11743 to 8751
   goals met: 1 of 3
7. (debark person1 plane2 city2)
   deleted: (in person1 plane2)
   added: (at person1 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 3
8. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 12302 to 15294, (fuel plane2) from 8751 to 5759
   goals met: 3 of 3
